{
  "recipes": [
    {
      "id": 1,
      "name": "Classic Chocolate Chip Cookies",
      "category": "Cookies",
      "difficulty": "Easy",
      "prepTime": "15 minutes",
      "cookTime": "12 minutes",
      "totalTime": "27 minutes",
      "servings": "24 cookies",
      "image": "images/placeholder.svg",
      "description": "Soft, chewy chocolate chip cookies with the perfect balance of sweet and buttery flavors. A timeless classic that everyone loves!",
      "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 tsp baking soda",
        "1 tsp salt",
        "1 cup (2 sticks) butter, softened",
        "3/4 cup granulated sugar",
        "3/4 cup packed brown sugar",
        "2 large eggs",
        "2 tsp vanilla extract",
        "2 cups semi-sweet chocolate chips"
      ],
      "instructions": [
        "Preheat oven to 375째F (190째C).",
        "In a small bowl, combine flour, baking soda, and salt. Set aside.",
        "In a large bowl, beat butter, granulated sugar, and brown sugar until creamy.",
        "Add eggs and vanilla extract to the butter mixture. Beat well.",
        "Gradually blend in the flour mixture.",
        "Stir in chocolate chips.",
        "Drop rounded tablespoons of dough onto ungreased cookie sheets.",
        "Bake for 9-11 minutes or until golden brown.",
        "Cool on baking sheet for 2 minutes, then remove to a wire rack.",
        "Enjoy warm or store in an airtight container."
      ],
      "tips": [
        "For extra chewy cookies, slightly underbake them.",
        "Chill the dough for 30 minutes before baking for thicker cookies.",
        "Room temperature butter mixes better with sugars."
      ]
    },
    {
      "id": 2,
      "name": "Vanilla Buttercream Frosting",
      "category": "Frosting",
      "difficulty": "Easy",
      "prepTime": "10 minutes",
      "cookTime": "0 minutes",
      "totalTime": "10 minutes",
      "servings": "Frosts one 9-inch layer cake",
      "image": "images/placeholder.svg",
      "description": "Smooth, creamy, and perfectly sweet vanilla buttercream that's ideal for cakes, cupcakes, and cookies.",
      "ingredients": [
        "1 cup (2 sticks) unsalted butter, softened",
        "4 cups powdered sugar",
        "2 tsp vanilla extract",
        "3-4 tbsp heavy cream or milk",
        "Pinch of salt"
      ],
      "instructions": [
        "Beat the softened butter in a large bowl until creamy and smooth (about 2-3 minutes).",
        "Gradually add powdered sugar, one cup at a time, beating on low speed.",
        "Add vanilla extract and salt.",
        "Add heavy cream one tablespoon at a time until you reach desired consistency.",
        "Increase speed to medium-high and beat for 3-4 minutes until light and fluffy.",
        "Use immediately or store in refrigerator for up to 2 weeks."
      ],
      "tips": [
        "Make sure butter is at room temperature for best results.",
        "Add more cream for a softer frosting, less for stiffer frosting.",
        "Add food coloring after achieving desired consistency.",
        "For chocolate buttercream, add 1/2 cup cocoa powder with the powdered sugar."
      ]
    },
    {
      "id": 3,
      "name": "Homemade Pie Crust",
      "category": "Basics",
      "difficulty": "Medium",
      "prepTime": "15 minutes",
      "cookTime": "0 minutes (plus 1 hour chill time)",
      "totalTime": "1 hour 15 minutes",
      "servings": "Two 9-inch pie crusts",
      "image": "images/placeholder.svg",
      "description": "Flaky, buttery pie crust made from scratch. Perfect for both sweet and savory pies.",
      "ingredients": [
        "2 1/2 cups all-purpose flour",
        "1 tsp salt",
        "1 tbsp granulated sugar",
        "1 cup (2 sticks) cold unsalted butter, cut into small cubes",
        "6-8 tbsp ice water"
      ],
      "instructions": [
        "In a large bowl, whisk together flour, salt, and sugar.",
        "Add cold butter cubes to the flour mixture.",
        "Using a pastry cutter or your fingers, work the butter into the flour until it resembles coarse crumbs with pea-sized pieces of butter.",
        "Sprinkle ice water over the mixture, one tablespoon at a time, mixing gently with a fork.",
        "Continue adding water until the dough just starts to come together.",
        "Divide dough in half and form into two flat disks.",
        "Wrap each disk in plastic wrap and refrigerate for at least 1 hour.",
        "When ready to use, roll out on a floured surface to desired thickness.",
        "Use for your favorite pie recipe!"
      ],
      "tips": [
        "Keep everything cold - cold butter makes flakier crust.",
        "Don't overwork the dough or it will become tough.",
        "Dough can be frozen for up to 3 months.",
        "For a golden crust, brush with egg wash before baking."
      ]
    },
    {
      "id": 4,
      "name": "Simple Sugar Cookies",
      "category": "Cookies",
      "difficulty": "Easy",
      "prepTime": "20 minutes",
      "cookTime": "10 minutes",
      "totalTime": "30 minutes (plus chill time)",
      "servings": "30 cookies",
      "image": "images/placeholder.svg",
      "description": "Perfect cut-out sugar cookies that hold their shape. Ideal for decorating with royal icing for any occasion!",
      "ingredients": [
        "3 cups all-purpose flour",
        "1 tsp baking powder",
        "1/2 tsp salt",
        "1 cup (2 sticks) unsalted butter, softened",
        "1 1/2 cups granulated sugar",
        "2 large eggs",
        "2 tsp vanilla extract",
        "1/2 tsp almond extract (optional)"
      ],
      "instructions": [
        "In a medium bowl, whisk together flour, baking powder, and salt.",
        "In a large bowl, beat butter and sugar until light and fluffy (3-4 minutes).",
        "Beat in eggs one at a time, then add vanilla and almond extract.",
        "Gradually mix in the flour mixture until just combined.",
        "Divide dough in half, flatten into disks, wrap in plastic, and chill for 2 hours.",
        "Preheat oven to 350째F (175째C).",
        "Roll dough to 1/4-inch thickness on a floured surface.",
        "Cut into desired shapes and place on parchment-lined baking sheets.",
        "Bake for 8-10 minutes until edges just start to turn golden.",
        "Cool completely before decorating."
      ],
      "tips": [
        "Chilling the dough is essential for cookies that hold their shape.",
        "Don't overbake - remove when edges just barely start to brown.",
        "Re-roll scraps only once to prevent tough cookies.",
        "Decorate with royal icing, buttercream, or simple glaze."
      ]
    }
  ]
}
